heatSolverFEniCSx_OpenFOAM/caseA/fluid/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  7
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system/fluid";
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    rho
    {
        solver          diagonal;
    }

    rhoFinal
    {
        $rho;
    }

    p_rgh
    {
        solver           GAMG;
        smoother         symGaussSeidel;
        tolerance        1e-7;
        relTol           0;
    }

    p_rghFinal
    {
        $p_rgh;
        relTol           0;
    }

    "(U|h)"
    {
        solver           PBiCGStab;
        preconditioner   DILU;
        tolerance        1e-14;
        relTol           0;
    }

    "(U|h)Final"
    {
        $U;
        relTol           0;
    }
}

PIMPLE
{
    nCorrectors 1;
    nOuterCorrectors 1;
    momentumPredictor   yes;
    pRefCell    0;
    pRefValue    1e5;
}

relaxationFactors
{
}

// ************************************************************************* //
